import math

d0 = [276.6067, 276.6119, 276.6311, 276.6268]
d1 = [0.051111, 0.051090, 0.051033, 0.051058]
d2 = [1.405783e-6, 1.496037e-6, 1.49699e-6, 1.49311e-6]

T_prt = []
c = [21, 36, 22, 13]
for i in range(4):
    T_prt.append(d0[i] + d1[i] * c[i] + d2[i] * c[i] ** 2)

T_bb = sum(T_prt) / 4  # температура абсолютно черного тела

A = 1.67396
B = 0.997364
T_bb_ = A + B * T_bb  # эффективная температура абсолютно черного тела

v_c = 2670

c_1 = 1.1910427e-5
c_2 = 1.4387752

N_bb = (c_1 * v_c ** 3) / (math.e ** (c_2 * v_c / T_bb_) - 1)  # изучение абсолютно черного тела

C_S = 21  # яркость космоса
print('Яркость исследуемой точки:', end=' ')
C_E = int(input())
C_BB = 84  # яркость абсолютно черного тела

N_LIN = N_bb * (C_S - C_E) / (C_S - C_BB)

ln = math.log(1 + (c_1 * v_c ** 3 / N_LIN)) / math.log(math.e)

T_E_ = c_2 * v_c / ln
T_E = (T_E_ - A) / B
print('Температура исследуемой точки:', str(T_E)[:7], 'K')
